frostynova/m5stack-tab5-pal/sdkconfig.defaults
# M5Stack Tab5 / ESP32-P4
CONFIG_IDF_TARGET="esp32p4"
# The connected Tab5 uses ESP32-P4 revision v1.3. Revisions below v3 and v3+
# are not binary compatible, so select the legacy silicon explicitly.
CONFIG_ESP32P4_SELECTS_REV_LESS_V3=y
CONFIG_ESP32P4_REV_MIN_100=y
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# SDL board selection
CONFIG_SDL_BSP_M5STACK_TAB5=y
CONFIG_SDL_BSP_TOUCH_ENABLE=y

# Tab5 has 32 MiB Hex PSRAM. The display path requires 200 MHz PSRAM.
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_HEX=y
CONFIG_SPIRAM_SPEED_200M=y
CONFIG_SPIRAM_FETCH_INSTRUCTIONS=y
CONFIG_SPIRAM_RODATA=y
CONFIG_SPIRAM_ALLOW_BSS_SEG_EXTERNAL_MEMORY=y

CONFIG_COMPILER_OPTIMIZATION_PERF=y
CONFIG_FREERTOS_HZ=1000
CONFIG_ESP_MAIN_TASK_STACK_SIZE=16384
CONFIG_ESP_SYSTEM_PANIC_PRINT_REBOOT=y
